# -*- coding: utf-8 -*-
"""Подмножества.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1cXxazlSWOS8RV4eGGl3k2VifuNZ2SS2M
"""

'''Напишите класс Python, чтобы получить все возможные уникальные подмножества из набора различных целых чисел. - Перейти к редактору
Вход: [4, 5, 6]
Вывод: [[], [6], [5], [5, 6], [4], [4, 6], [4, 5], [4, 5, 6]]'''
#1 вариант
from itertools import combinations
l = [4, 5, 6]
d = []
for i in range(len(l)+1):
  d.append([j for j in combinations(l,i)])
print(d)

#2 вариант
from itertools import combinations
 
class x:
    def __init__(self, lst):
        self.lst = set(lst)
 
    def result(self):
        return[list(j) for i in range(len(self.lst) + 1) for j in combinations(self.lst, i)]
 
print(x([4, 5, 6]).result())